'''
Задача:
Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6. 
Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака. 
Объяснить полученный результат.

'''

a10 = 5
b10 = 6
a2 = bin(a10)
b2 = bin(b10)
a2s = str(bin(5))[2:]
b2s = str(bin(6))[2:]

# logic_operators = ["&", "|", "^", "<<", ">>"] #"~",
logic_operators = {"&":"И",
            "|":"ИЛИ",
            "^":"Исключаеющее ИЛИ", 
            # "~":"Инверсия", 
            "<<":"Побитовый сдвиг влево", 
            ">>":"Побитовый сдвиг вправо"}

print(f"Число 5 в двоичной системе исчисления: {a2s}")
print(f"Число 6 в двоичной системе исчисления: {b2s}\n")
for op, meaning in logic_operators.items():
    if op == "<<" or op == ">>":
        x = a10
        y = 2
    else:
        x = a10
        y = b10

    print(f"Логический оператор \"{meaning}\":")
    res = eval(f"str(bin({x}{op}{y}))[2:]")
    print(f"{x}{op}{y}={res}")